wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
/**************************************************************************//**
 * @file     clk.c
 * @version  V1.00
 * @brief    CLK driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup CLK_Driver CLK Driver
  @{
*/

/** @addtogroup CLK_EXPORTED_FUNCTIONS CLK Exported Functions
  @{
*/

/**
  * @brief      Disable clock divider output function
  * @param      None
  * @return     None
  * @details    This function disable clock divider output function.
  */
void CLK_DisableCKO(void)
{
    /* Disable CKO clock source */
    CLK->CLKOCTL &= (~CLK_CLKOCTL_CLKOEN_Msk);
}

/**
  * @brief      This function is enable clock output module,
  *             enable clock output divider function and set frequency selection.
  * @param[in]  u32ClkSrc is frequency divider function clock source. Including :
  *             - \ref CLK_CLKOSEL_CLKOSEL_SYSCLK
  *             - \ref CLK_CLKOSEL_CLKOSEL_ACLK
  *             - \ref CLK_CLKOSEL_CLKOSEL_HCLK0
  *             - \ref CLK_CLKOSEL_CLKOSEL_HCLK1
  *             - \ref CLK_CLKOSEL_CLKOSEL_HCLK2
  *             - \ref CLK_CLKOSEL_CLKOSEL_APLL0_DIV2
  *             - \ref CLK_CLKOSEL_CLKOSEL_APLL1_DIV2
  *             - \ref CLK_CLKOSEL_CLKOSEL_HIRC48M
  *             - \ref CLK_CLKOSEL_CLKOSEL_HXT
  *             - \ref CLK_CLKOSEL_CLKOSEL_HIRC
  *             - \ref CLK_CLKOSEL_CLKOSEL_MIRC
  *             - \ref CLK_CLKOSEL_CLKOSEL_LXT
  *             - \ref CLK_CLKOSEL_CLKOSEL_LIRC
  * @param[in]  u32ClkDiv is divider output frequency selection. It could be 0~15.
  * @param[in]  u32ClkDivBy1En is clock divider setting. Including :
  *             - \ref CLK_CLKOCTL_DIV1EN_DIV_FREQSEL
  *             - \ref CLK_CLKOCTL_DIV1EN_DIV_1
  * @return     None
  * @details    Output selected clock to CKO. The output clock frequency is divided by u32ClkDiv. \n
  *             The formula is: \n
  *                 CKO frequency = (Clock source frequency) / 2^(u32ClkDiv + 1) \n
  *             This function is just used to set CKO clock.
  *             User must enable I/O for CKO clock output pin by themselves. \n
  */
void CLK_EnableCKO(uint32_t u32ClkSrc, uint32_t u32ClkDiv, uint32_t u32ClkDivBy1En)
{
    /* CKO = clock source / 2^(u32ClkDiv + 1) */
    CLK->CLKOCTL = CLK_CLKOCTL_CLKOEN_Msk | (u32ClkDiv) | (u32ClkDivBy1En << CLK_CLKOCTL_DIV1EN_Pos);

    /* Select CKO clock source */
    CLK->CLKOSEL = (CLK->CLKOSEL & (~CLK_CLKOSEL_CLKOSEL_Msk)) | (u32ClkSrc);
}

/**
  * @brief      Get external high speed crystal clock frequency
  * @param      None
  * @return     External high frequency crystal frequency
  * @details    This function get external high frequency crystal frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetHXTFreq(void)
{
    uint32_t u32Freq;

    if (CLK->SRCCTL & CLK_SRCCTL_HXTEN_Msk)
    {
        u32Freq = __HXT;
    }
    else
    {
        u32Freq = 0UL;
    }

    return u32Freq;
}

/**
  * @brief      Get external low speed crystal clock frequency
  * @param      None
  * @return     External low speed crystal clock frequency
  * @details    This function get external low frequency crystal frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetLXTFreq(void)
{
    uint32_t u32Freq;

    if (CLK->SRCCTL & CLK_SRCCTL_LXTEN_Msk)
    {
        u32Freq = __LXT;
    }
    else
    {
        u32Freq = 0UL;
    }

    return u32Freq;
}

/**
  * @brief      Get Internal Middle Speed RC Oscillator clock frequency
  * @param      None
  * @return     Internal Middle Speed RC Oscillator clock frequency
  * @details    This function get Internal Middle Speed RC Oscillator frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetMIRCFreq(void)
{
    uint32_t u32Freq;

    if ((CLK->SRCCTL & CLK_SRCCTL_MIRCEN_Msk) == CLK_SRCCTL_MIRCEN_Msk)
    {
        switch (CLK->MIRCCTL & CLK_MIRCCTL_MIRCFSEL_Msk)
        {
            case CLK_MIRCCTL_MIRCFSEL_1MHZ:
                u32Freq = FREQ_1MHZ;
                break;

            case CLK_MIRCCTL_MIRCFSEL_2MHZ:
                u32Freq = FREQ_2MHZ;
                break;

            case CLK_MIRCCTL_MIRCFSEL_4MHZ:
                u32Freq = FREQ_4MHZ;
                break;

            case CLK_MIRCCTL_MIRCFSEL_8MHZ:
                u32Freq = FREQ_8MHZ;
                break;

            default:
                u32Freq = __MIRC;
                break;
        }
    }
    else
    {
        u32Freq = 0UL;
    }

    return u32Freq;
}

/**
  * @brief      Disable MIRC
  * @param      None
  * @return     None
  * @details    This function disable MIRC clock. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_DisableMIRC(void)
{
    CLK->SRCCTL &= ~CLK_SRCCTL_MIRCEN_Msk;
}

/**
  * @brief      Set MIRC frequency
  * @param[in]  u32MircFreq is MIRC clock frequency. Including :
  *             - \ref CLK_MIRCCTL_MIRCFSEL_1MHZ
  *             - \ref CLK_MIRCCTL_MIRCFSEL_2MHZ
  *             - \ref CLK_MIRCCTL_MIRCFSEL_4MHZ
  *             - \ref CLK_MIRCCTL_MIRCFSEL_8MHZ
  * @return     MIRC frequency
  * @details    This function is used to configure PWRCTL register to set specified MIRC frequency. \n
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_EnableMIRC(uint32_t u32MircFreq)
{
    /* Disable MIRC first to avoid unstable when setting MIRC */
    CLK_DisableMIRC();

    /* Select MIRC frequency */
    CLK->MIRCCTL = (CLK->MIRCCTL & ~CLK_MIRCCTL_MIRCFSEL_Msk) | u32MircFreq;

    /* Enable and apply new MIRC setting. */
    CLK->SRCCTL |= CLK_SRCCTL_MIRCEN_Msk;

    /* Wait for MIRC clock stable */
    CLK_WaitClockReady(CLK_STATUS_MIRCSTB_Msk);

    /* Return actual MIRC output clock frequency */
    return CLK_GetMIRCFreq();
}

/**
  * @brief      Get PCLK0 frequency
  * @param      None
  * @return     PCLK0 frequency
  * @details    This function get PCLK0 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetPCLK0Freq(void)
{
    uint32_t u32Freq, u32Hclk0Freq;

