wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
    /* Switch to HIRC for safe. Avoid SCLK too high when applying new divider. */
    CLK->SRCCTL |= CLK_SRCCTL_HIRCEN_Msk;
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
    CLK->SCLKSEL = (CLK->SCLKSEL & (~CLK_SCLKSEL_SCLKSEL_Msk)) | CLK_SCLKSEL_SCLKSEL_HIRC;

    /* Switch to power level 0 for safe */
    PMC->PLCTL = (PMC->PLCTL & (~PMC_PLCTL_PLSEL_Msk)) | PMC_PLCTL_PLSEL_PL0;
    u32TimeOutCount = SystemCoreClock; /* 1 second time-out */

    while (PMC->PLSTS & PMC_PLSTS_PLCBUSY_Msk)
    {
        if (u32TimeOutCount-- == 0) break;
    }

    /* Set Flash Access Cycle to 8 for safe */
    FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (8);

    /* Switch SCLK to new SCLK source */
    CLK->SCLKSEL = (CLK->SCLKSEL & (~CLK_SCLKSEL_SCLKSEL_Msk)) | u32ClkSrc;

    /* Update System Core Clock */
    SystemCoreClockUpdate();

    /* Set power level according to new HCLK */
    if (SystemCoreClock <= FREQ_180MHZ)
    {
        PMC->PLCTL = (PMC->PLCTL & (~PMC_PLCTL_PLSEL_Msk)) | PMC_PLCTL_PLSEL_PL1;
    }

    u32TimeOutCount = SystemCoreClock; /* 1 second time-out */

    while (PMC->PLSTS & PMC_PLSTS_PLCBUSY_Msk)
    {
        if (u32TimeOutCount-- == 0) break;
    }

    /* Switch flash access cycle to suitable value base on SCLK */
    if (SystemCoreClock > FREQ_200MHZ)
    {
        FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (6);
    }
    else if (SystemCoreClock > FREQ_160MHZ)
    {
        FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (5);
    }
    else if (SystemCoreClock > FREQ_120MHZ)
    {
        FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (4);
    }
    else if (SystemCoreClock > FREQ_80MHZ)
    {
        FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (3);
    }
    else if (SystemCoreClock > FREQ_40MHZ)
    {
        FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (2);
    }
    else /* SystemCoreClock <= FREQ_40MHZ */
    {
        FMC->CYCCTL = (FMC->CYCCTL & (~FMC_CYCCTL_CYCLE_Msk)) | (1);
    }

    /* Disable HIRC if HIRC is disabled before switching SCLK source */
    if (u32HIRCSTB == 0UL)
    {
        CLK->SRCCTL &= ~CLK_SRCCTL_HIRCEN_Msk;
    }
}

/**
  * @brief      This function set selected module clock source and module clock divider
  * @param[in]  u64ModuleIdx is module index.
  * @param[in]  u32ClkSrc is module clock source.
  * @param[in]  u32ClkDiv is module clock divider.
  * @return     None
  * @details    Valid parameter combinations listed in following table:
  *
  * |Module index        |Clock source                              |Divider                         |
  * | :----------------- | :--------------------------------------- | :----------------------------- |
  * |\ref BPWM0_MODULE   |\ref CLK_BPWMSEL_BPWM0SEL_PCLK0           | x                              |
  * |\ref BPWM0_MODULE   |\ref CLK_BPWMSEL_BPWM0SEL_HCLK0           | x                              |
  * |\ref BPWM1_MODULE   |\ref CLK_BPWMSEL_BPWM1SEL_PCLK2           | x                              |
  * |\ref BPWM1_MODULE   |\ref CLK_BPWMSEL_BPWM1SEL_HCLK0           | x                              |
  * |\ref CANFD0_MODULE  |\ref CLK_CANFDSEL_CANFD0SEL_HXT           |\ref CLK_CANFDDIV_CANFD0DIV(x)  |
  * |\ref CANFD0_MODULE  |\ref CLK_CANFDSEL_CANFD0SEL_APLL0_DIV2    |\ref CLK_CANFDDIV_CANFD0DIV(x)  |
  * |\ref CANFD0_MODULE  |\ref CLK_CANFDSEL_CANFD0SEL_HCLK0         |\ref CLK_CANFDDIV_CANFD0DIV(x)  |
  * |\ref CANFD0_MODULE  |\ref CLK_CANFDSEL_CANFD0SEL_HIRC          |\ref CLK_CANFDDIV_CANFD0DIV(x)  |
  * |\ref CANFD0_MODULE  |\ref CLK_CANFDSEL_CANFD0SEL_HIRC48M_DIV4  |\ref CLK_CANFDDIV_CANFD0DIV(x)  |
  * |\ref CANFD1_MODULE  |\ref CLK_CANFDSEL_CANFD1SEL_HXT           |\ref CLK_CANFDDIV_CANFD1DIV(x)  |
  * |\ref CANFD1_MODULE  |\ref CLK_CANFDSEL_CANFD1SEL_APLL0_DIV2    |\ref CLK_CANFDDIV_CANFD1DIV(x)  |
  * |\ref CANFD1_MODULE  |\ref CLK_CANFDSEL_CANFD1SEL_HCLK0         |\ref CLK_CANFDDIV_CANFD1DIV(x)  |
  * |\ref CANFD1_MODULE  |\ref CLK_CANFDSEL_CANFD1SEL_HIRC          |\ref CLK_CANFDDIV_CANFD1DIV(x)  |
  * |\ref CANFD1_MODULE  |\ref CLK_CANFDSEL_CANFD1SEL_HIRC48M_DIV4  |\ref CLK_CANFDDIV_CANFD1DIV(x)  |
  * |\ref CCAP0_MODULE   |\ref CLK_CCAPSEL_CCAP0SEL_MIRC            | x                              |
  * |\ref CCAP0_MODULE   |\ref CLK_CCAPSEL_CCAP0SEL_HCLK2           | x                              |
  * |\ref CCAP0_MODULE   |\ref CLK_CCAPSEL_CCAP0SEL_HIRC            | x                              |
  * |\ref CCAP0_MODULE   |\ref CLK_CCAPSEL_CCAP0SEL_APLL0_DIV2      | x                              |
  * |\ref CCAP0_MODULE   |\ref CLK_CCAPSEL_CCAP0SEL_HXT             | x                              |
  * |\ref DMIC0_MODULE   |\ref CLK_DMICSEL_DMIC0SEL_HXT             |\ref CLK_DMICDIV_DMIC0DIV(x)    |
  * |\ref DMIC0_MODULE   |\ref CLK_DMICSEL_DMIC0SEL_APLL1_DIV2      |\ref CLK_DMICDIV_DMIC0DIV(x)    |
  * |\ref DMIC0_MODULE   |\ref CLK_DMICSEL_DMIC0SEL_MIRC            |\ref CLK_DMICDIV_DMIC0DIV(x)    |
  * |\ref DMIC0_MODULE   |\ref CLK_DMICSEL_DMIC0SEL_HIRC            |\ref CLK_DMICDIV_DMIC0DIV(x)    |
  * |\ref DMIC0_MODULE   |\ref CLK_DMICSEL_DMIC0SEL_HIRC48M         |\ref CLK_DMICDIV_DMIC0DIV(x)    |
  * |\ref DMIC0_MODULE   |\ref CLK_DMICSEL_DMIC0SEL_PCLK4           |\ref CLK_DMICDIV_DMIC0DIV(x)    |
  * |\ref EADC0_MODULE   |\ref CLK_EADCSEL_EADC0SEL_APLL1_DIV2      |\ref CLK_EADCDIV_EADC0DIV(x)    |
  * |\ref EADC0_MODULE   |\ref CLK_EADCSEL_EADC0SEL_APLL0_DIV2      |\ref CLK_EADCDIV_EADC0DIV(x)    |
  * |\ref EADC0_MODULE   |\ref CLK_EADCSEL_EADC0SEL_PCLK0           |\ref CLK_EADCDIV_EADC0DIV(x)    |
  * |\ref EADC1_MODULE   |\ref CLK_EADCSEL_EADC1SEL_APLL1_DIV2      |\ref CLK_EADCDIV_EADC1DIV(x)    |
  * |\ref EADC1_MODULE   |\ref CLK_EADCSEL_EADC1SEL_APLL0_DIV2      |\ref CLK_EADCDIV_EADC1DIV(x)    |
  * |\ref EADC1_MODULE   |\ref CLK_EADCSEL_EADC1SEL_PCLK2           |\ref CLK_EADCDIV_EADC1DIV(x)    |
  * |\ref EPWM0_MODULE   |\ref CLK_EPWMSEL_EPWM0SEL_PCLK0           | x                              |
  * |\ref EPWM0_MODULE   |\ref CLK_EPWMSEL_EPWM0SEL_HCLK0           | x                              |
  * |\ref EPWM1_MODULE   |\ref CLK_EPWMSEL_EPWM1SEL_PCLK2           | x                              |
  * |\ref EPWM1_MODULE   |\ref CLK_EPWMSEL_EPWM1SEL_HCLK0           | x                              |
  * |\ref FMC0_MODULE    |\ref CLK_FMCSEL_FMC0SEL_HIRC              | x                              |
  * |\ref FMC0_MODULE    |\ref CLK_FMCSEL_FMC0SEL_HIRC48M_DIV4      | x                              |
  * |\ref I2S0_MODULE    |\ref CLK_I2SSEL_I2S0SEL_HXT               |\ref CLK_I2SDIV_I2S0DIV(x)      |
  * |\ref I2S0_MODULE    |\ref CLK_I2SSEL_I2S0SEL_APLL1_DIV2        |\ref CLK_I2SDIV_I2S0DIV(x)      |
  * |\ref I2S0_MODULE    |\ref CLK_I2SSEL_I2S0SEL_APLL0_DIV2        |\ref CLK_I2SDIV_I2S0DIV(x)      |
  * |\ref I2S0_MODULE    |\ref CLK_I2SSEL_I2S0SEL_PCLK1             |\ref CLK_I2SDIV_I2S0DIV(x)      |
  * |\ref I2S0_MODULE    |\ref CLK_I2SSEL_I2S0SEL_HIRC              |\ref CLK_I2SDIV_I2S0DIV(x)      |
  * |\ref I2S0_MODULE    |\ref CLK_I2SSEL_I2S0SEL_HIRC48M           |\ref CLK_I2SDIV_I2S0DIV(x)      |
  * |\ref I2S1_MODULE    |\ref CLK_I2SSEL_I2S1SEL_HXT               |\ref CLK_I2SDIV_I2S1DIV(x)      |
  * |\ref I2S1_MODULE    |\ref CLK_I2SSEL_I2S1SEL_APLL1_DIV2        |\ref CLK_I2SDIV_I2S1DIV(x)      |
  * |\ref I2S1_MODULE    |\ref CLK_I2SSEL_I2S1SEL_APLL0_DIV2        |\ref CLK_I2SDIV_I2S1DIV(x)      |
  * |\ref I2S1_MODULE    |\ref CLK_I2SSEL_I2S1SEL_PCLK3             |\ref CLK_I2SDIV_I2S1DIV(x)      |
  * |\ref I2S1_MODULE    |\ref CLK_I2SSEL_I2S1SEL_HIRC              |\ref CLK_I2SDIV_I2S1DIV(x)      |
  * |\ref I2S1_MODULE    |\ref CLK_I2SSEL_I2S1SEL_HIRC48M           |\ref CLK_I2SDIV_I2S1DIV(x)      |
  * |\ref I3C0_MODULE    |\ref CLK_I3CSEL_I3C0SEL_HCLK0             | x                              |
  * |\ref I3C0_MODULE    |\ref CLK_I3CSEL_I3C0SEL_APLL1             | x                              |    
  * |\ref KPI0_MODULE    |\ref CLK_KPISEL_KPI0SEL_HIRC48M_DIV4      |\ref CLK_KPIDIV_KPI0DIV(x)      |
  * |\ref KPI0_MODULE    |\ref CLK_KPISEL_KPI0SEL_HIRC              |\ref CLK_KPIDIV_KPI0DIV(x)      |
  * |\ref KPI0_MODULE    |\ref CLK_KPISEL_KPI0SEL_LIRC              |\ref CLK_KPIDIV_KPI0DIV(x)      |
  * |\ref KPI0_MODULE    |\ref CLK_KPISEL_KPI0SEL_HXT               |\ref CLK_KPIDIV_KPI0DIV(x)      |
  * |\ref LPADC0_MODULE  |\ref CLK_LPADCSEL_LPADC0SEL_PCLK4         |\ref CLK_LPADCDIV_LPADC0DIV(x)  |
  * |\ref LPADC0_MODULE  |\ref CLK_LPADCSEL_LPADC0SEL_LXT           |\ref CLK_LPADCDIV_LPADC0DIV(x)  |
  * |\ref LPADC0_MODULE  |\ref CLK_LPADCSEL_LPADC0SEL_MIRC          |\ref CLK_LPADCDIV_LPADC0DIV(x)  |
  * |\ref LPADC0_MODULE  |\ref CLK_LPADCSEL_LPADC0SEL_HIRC          |\ref CLK_LPADCDIV_LPADC0DIV(x)  |
  * |\ref LPSPI0_MODULE  |\ref CLK_LPSPISEL_LPSPI0SEL_PCLK4         | x                              |
  * |\ref LPSPI0_MODULE  |\ref CLK_LPSPISEL_LPSPI0SEL_MIRC          | x                              |
  * |\ref LPSPI0_MODULE  |\ref CLK_LPSPISEL_LPSPI0SEL_HIRC          | x                              |
  * |\ref LPTMR0_MODULE  |\ref CLK_LPTMRSEL_LPTMR0SEL_PCLK4         | x                              |
  * |\ref LPTMR0_MODULE  |\ref CLK_LPTMRSEL_LPTMR0SEL_LXT           | x                              |
  * |\ref LPTMR0_MODULE  |\ref CLK_LPTMRSEL_LPTMR0SEL_LIRC          | x                              |
  * |\ref LPTMR0_MODULE  |\ref CLK_LPTMRSEL_LPTMR0SEL_MIRC          | x                              |
  * |\ref LPTMR0_MODULE  |\ref CLK_LPTMRSEL_LPTMR0SEL_HIRC          | x                              |
  * |\ref LPTMR0_MODULE  |\ref CLK_LPTMRSEL_LPTMR0SEL_EXT           | x                              |
  * |\ref LPTMR1_MODULE  |\ref CLK_LPTMRSEL_LPTMR1SEL_PCLK4         | x                              |
  * |\ref LPTMR1_MODULE  |\ref CLK_LPTMRSEL_LPTMR1SEL_LXT           | x                              |
  * |\ref LPTMR1_MODULE  |\ref CLK_LPTMRSEL_LPTMR1SEL_LIRC          | x                              |
  * |\ref LPTMR1_MODULE  |\ref CLK_LPTMRSEL_LPTMR1SEL_MIRC          | x                              |
  * |\ref LPTMR1_MODULE  |\ref CLK_LPTMRSEL_LPTMR1SEL_HIRC          | x                              |
  * |\ref LPTMR1_MODULE  |\ref CLK_LPTMRSEL_LPTMR1SEL_EXT           | x                              |
  * |\ref LPUART0_MODULE |\ref CLK_LPUARTSEL_LPUART0SEL_PCLK4       |\ref CLK_LPUARTDIV_LPUART0DIV(x)|
  * |\ref LPUART0_MODULE |\ref CLK_LPUARTSEL_LPUART0SEL_LXT         |\ref CLK_LPUARTDIV_LPUART0DIV(x)|
  * |\ref LPUART0_MODULE |\ref CLK_LPUARTSEL_LPUART0SEL_MIRC        |\ref CLK_LPUARTDIV_LPUART0DIV(x)|
  * |\ref LPUART0_MODULE |\ref CLK_LPUARTSEL_LPUART0SEL_HIRC        |\ref CLK_LPUARTDIV_LPUART0DIV(x)|
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_LXT             |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_HXT             |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_LIRC            |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_HIRC            |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_HIRC48M_DIV4    |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_PCLK1           |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref PSIO0_MODULE   |\ref CLK_PSIOSEL_PSIO0SEL_APLL0_DIV2      |\ref CLK_PSIODIV_PSIO0DIV(x)    |
  * |\ref QSPI0_MODULE   |\ref CLK_QSPISEL_QSPI0SEL_HXT             | x                              |
  * |\ref QSPI0_MODULE   |\ref CLK_QSPISEL_QSPI0SEL_APLL0_DIV2      | x                              |
  * |\ref QSPI0_MODULE   |\ref CLK_QSPISEL_QSPI0SEL_PCLK0           | x                              |
  * |\ref QSPI0_MODULE   |\ref CLK_QSPISEL_QSPI0SEL_HIRC            | x                              |
  * |\ref QSPI0_MODULE   |\ref CLK_QSPISEL_QSPI0SEL_HIRC48M_DIV4    | x                              |
  * |\ref QSPI1_MODULE   |\ref CLK_QSPISEL_QSPI1SEL_HXT             | x                              |
  * |\ref QSPI1_MODULE   |\ref CLK_QSPISEL_QSPI1SEL_APLL0_DIV2      | x                              |
  * |\ref QSPI1_MODULE   |\ref CLK_QSPISEL_QSPI1SEL_PCLK2           | x                              |
  * |\ref QSPI1_MODULE   |\ref CLK_QSPISEL_QSPI1SEL_HIRC            | x                              |
  * |\ref QSPI1_MODULE   |\ref CLK_QSPISEL_QSPI1SEL_HIRC48M_DIV4    | x                              |
  * |\ref SC0_MODULE     |\ref CLK_SCSEL_SC0SEL_HXT                 |\ref CLK_SCDIV_SC0DIV(x)        |
  * |\ref SC0_MODULE     |\ref CLK_SCSEL_SC0SEL_APLL0_DIV2          |\ref CLK_SCDIV_SC0DIV(x)        |
  * |\ref SC0_MODULE     |\ref CLK_SCSEL_SC0SEL_PCLK1               |\ref CLK_SCDIV_SC0DIV(x)        |
  * |\ref SC0_MODULE     |\ref CLK_SCSEL_SC0SEL_HIRC                |\ref CLK_SCDIV_SC0DIV(x)        |
  * |\ref SC0_MODULE     |\ref CLK_SCSEL_SC0SEL_HIRC48M_DIV4        |\ref CLK_SCDIV_SC0DIV(x)        |
  * |\ref SC1_MODULE     |\ref CLK_SCSEL_SC1SEL_HXT                 |\ref CLK_SCDIV_SC1DIV(x)        |
  * |\ref SC1_MODULE     |\ref CLK_SCSEL_SC1SEL_APLL0_DIV2          |\ref CLK_SCDIV_SC1DIV(x)        |
  * |\ref SC1_MODULE     |\ref CLK_SCSEL_SC1SEL_PCLK3               |\ref CLK_SCDIV_SC1DIV(x)        |
  * |\ref SC1_MODULE     |\ref CLK_SCSEL_SC1SEL_HIRC                |\ref CLK_SCDIV_SC1DIV(x)        |
  * |\ref SC1_MODULE     |\ref CLK_SCSEL_SC1SEL_HIRC48M_DIV4        |\ref CLK_SCDIV_SC1DIV(x)        |
  * |\ref SC2_MODULE     |\ref CLK_SCSEL_SC2SEL_HXT                 |\ref CLK_SCDIV_SC2DIV(x)        |
  * |\ref SC2_MODULE     |\ref CLK_SCSEL_SC2SEL_APLL0_DIV2          |\ref CLK_SCDIV_SC2DIV(x)        |
  * |\ref SC2_MODULE     |\ref CLK_SCSEL_SC2SEL_PCLK1               |\ref CLK_SCDIV_SC2DIV(x)        |
  * |\ref SC2_MODULE     |\ref CLK_SCSEL_SC2SEL_HIRC                |\ref CLK_SCDIV_SC2DIV(x)        |
  * |\ref SC2_MODULE     |\ref CLK_SCSEL_SC2SEL_HIRC48M_DIV4        |\ref CLK_SCDIV_SC2DIV(x)        |
  * |\ref SDH0_MODULE    |\ref CLK_SDHSEL_SDH0SEL_HXT               |\ref CLK_SDHDIV_SDH0DIV(x)      |
  * |\ref SDH0_MODULE    |\ref CLK_SDHSEL_SDH0SEL_APLL1_DIV2        |\ref CLK_SDHDIV_SDH0DIV(x)      |
  * |\ref SDH0_MODULE    |\ref CLK_SDHSEL_SDH0SEL_HCLK0             |\ref CLK_SDHDIV_SDH0DIV(x)      |
  * |\ref SDH0_MODULE    |\ref CLK_SDHSEL_SDH0SEL_HIRC              |\ref CLK_SDHDIV_SDH0DIV(x)      |
  * |\ref SDH0_MODULE    |\ref CLK_SDHSEL_SDH0SEL_HIRC48M_DIV4      |\ref CLK_SDHDIV_SDH0DIV(x)      |
  * |\ref SDH1_MODULE    |\ref CLK_SDHSEL_SDH1SEL_HXT               |\ref CLK_SDHDIV_SDH1DIV(x)      |
  * |\ref SDH1_MODULE    |\ref CLK_SDHSEL_SDH1SEL_APLL1_DIV2        |\ref CLK_SDHDIV_SDH1DIV(x)      |
  * |\ref SDH1_MODULE    |\ref CLK_SDHSEL_SDH1SEL_HCLK0             |\ref CLK_SDHDIV_SDH1DIV(x)      |
  * |\ref SDH1_MODULE    |\ref CLK_SDHSEL_SDH1SEL_HIRC              |\ref CLK_SDHDIV_SDH1DIV(x)      |
  * |\ref SDH1_MODULE    |\ref CLK_SDHSEL_SDH1SEL_HIRC48M_DIV4      |\ref CLK_SDHDIV_SDH1DIV(x)      |
  * |\ref SPI0_MODULE    |\ref CLK_SPISEL_SPI0SEL_HXT               | x                              |
  * |\ref SPI0_MODULE    |\ref CLK_SPISEL_SPI0SEL_APLL1_DIV2        | x                              |
  * |\ref SPI0_MODULE    |\ref CLK_SPISEL_SPI0SEL_APLL0_DIV2        | x                              |
  * |\ref SPI0_MODULE    |\ref CLK_SPISEL_SPI0SEL_PCLK0             | x                              |
  * |\ref SPI0_MODULE    |\ref CLK_SPISEL_SPI0SEL_HIRC              | x                              |
  * |\ref SPI0_MODULE    |\ref CLK_SPISEL_SPI0SEL_HIRC48M           | x                              |
  * |\ref SPI1_MODULE    |\ref CLK_SPISEL_SPI1SEL_HXT               | x                              |
  * |\ref SPI1_MODULE    |\ref CLK_SPISEL_SPI1SEL_APLL1_DIV2        | x                              |
  * |\ref SPI1_MODULE    |\ref CLK_SPISEL_SPI1SEL_APLL0_DIV2        | x                              |
  * |\ref SPI1_MODULE    |\ref CLK_SPISEL_SPI1SEL_PCLK2             | x                              |
  * |\ref SPI1_MODULE    |\ref CLK_SPISEL_SPI1SEL_HIRC              | x                              |
  * |\ref SPI1_MODULE    |\ref CLK_SPISEL_SPI1SEL_HIRC48M           | x                              |
  * |\ref SPI2_MODULE    |\ref CLK_SPISEL_SPI2SEL_HXT               | x                              |
  * |\ref SPI2_MODULE    |\ref CLK_SPISEL_SPI2SEL_APLL1_DIV2        | x                              |
  * |\ref SPI2_MODULE    |\ref CLK_SPISEL_SPI2SEL_APLL0_DIV2        | x                              |
  * |\ref SPI2_MODULE    |\ref CLK_SPISEL_SPI2SEL_PCLK0             | x                              |
  * |\ref SPI2_MODULE    |\ref CLK_SPISEL_SPI2SEL_HIRC              | x                              |
  * |\ref SPI2_MODULE    |\ref CLK_SPISEL_SPI2SEL_HIRC48M           | x                              |
  * |\ref SPI3_MODULE    |\ref CLK_SPISEL_SPI3SEL_HXT               | x                              |
  * |\ref SPI3_MODULE    |\ref CLK_SPISEL_SPI3SEL_APLL1_DIV2        | x                              |
  * |\ref SPI3_MODULE    |\ref CLK_SPISEL_SPI3SEL_APLL0_DIV2        | x                              |
  * |\ref SPI3_MODULE    |\ref CLK_SPISEL_SPI3SEL_PCLK2             | x                              |
  * |\ref SPI3_MODULE    |\ref CLK_SPISEL_SPI3SEL_HIRC              | x                              |
  * |\ref SPI3_MODULE    |\ref CLK_SPISEL_SPI3SEL_HIRC48M           | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_HXT               | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_LXT               | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_PCLK1             | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_EXT               | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_LIRC              | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_HIRC              | x                              |
  * |\ref TMR0_MODULE    |\ref CLK_TMRSEL_TMR0SEL_HIRC48M_DIV4      | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_HXT               | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_LXT               | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_PCLK1             | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_EXT               | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_LIRC              | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_HIRC              | x                              |
  * |\ref TMR1_MODULE    |\ref CLK_TMRSEL_TMR1SEL_HIRC48M_DIV4      | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_HXT               | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_LXT               | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_PCLK3             | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_EXT               | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_LIRC              | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_HIRC              | x                              |
  * |\ref TMR2_MODULE    |\ref CLK_TMRSEL_TMR2SEL_HIRC48M_DIV4      | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_HXT               | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_LXT               | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_PCLK3             | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_EXT               | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_LIRC              | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_HIRC              | x                              |
  * |\ref TMR3_MODULE    |\ref CLK_TMRSEL_TMR3SEL_HIRC48M_DIV4      | x                              |
  * |\ref TTMR0_MODULE   |\ref CLK_TTMRSEL_TTMR0SEL_PCLK4           | x                              |
  * |\ref TTMR0_MODULE   |\ref CLK_TTMRSEL_TTMR0SEL_LXT             | x                              |
  * |\ref TTMR0_MODULE   |\ref CLK_TTMRSEL_TTMR0SEL_LIRC            | x                              |
  * |\ref TTMR0_MODULE   |\ref CLK_TTMRSEL_TTMR0SEL_MIRC            | x                              |
  * |\ref TTMR0_MODULE   |\ref CLK_TTMRSEL_TTMR0SEL_HIRC            | x                              |
  * |\ref TTMR1_MODULE   |\ref CLK_TTMRSEL_TTMR1SEL_PCLK4           | x                              |
  * |\ref TTMR1_MODULE   |\ref CLK_TTMRSEL_TTMR1SEL_LXT             | x                              |
  * |\ref TTMR1_MODULE   |\ref CLK_TTMRSEL_TTMR1SEL_LIRC            | x                              |
  * |\ref TTMR1_MODULE   |\ref CLK_TTMRSEL_TTMR1SEL_MIRC            | x                              |
  * |\ref TTMR1_MODULE   |\ref CLK_TTMRSEL_TTMR1SEL_HIRC            | x                              |
  * |\ref UART0_MODULE   |\ref CLK_UARTSEL0_UART0SEL_HXT            |\ref CLK_UARTDIV0_UART0DIV(x)   |
  * |\ref UART0_MODULE   |\ref CLK_UARTSEL0_UART0SEL_HIRC           |\ref CLK_UARTDIV0_UART0DIV(x)   |
  * |\ref UART0_MODULE   |\ref CLK_UARTSEL0_UART0SEL_LXT            |\ref CLK_UARTDIV0_UART0DIV(x)   |
  * |\ref UART0_MODULE   |\ref CLK_UARTSEL0_UART0SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART0DIV(x)   |
  * |\ref UART0_MODULE   |\ref CLK_UARTSEL0_UART0SEL_HIRC48M        |\ref CLK_UARTDIV0_UART0DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_HXT            |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_HIRC           |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_LXT            |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_HIRC48M        |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_HXT            |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_HIRC           |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_LXT            |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_HIRC48M        |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_HXT            |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_HIRC           |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_LXT            |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_HIRC48M        |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_HXT            |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_HIRC           |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_LXT            |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART4DIV(x)   |
